name: "2LayerSigmoid"
  layers {
    name: "data_valid"
    type: IMAGE_DATA
    top: "data"
    top: "label"
    image_data_param {
      source: "../valid.0.caffe"
      batch_size: 863
    }
    transform_param {
      scale: 0.00392156
    }
    include: {
      phase: TEST
    }
  }
  layers {
    name: "fc1"
    type: INNER_PRODUCT
    bottom: "data"
    top: "fc1"
    blobs_lr: 1
    blobs_lr: 2
    inner_product_param {
      num_output: 200
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
  }
  layers {
    name: "fc1_sigmoid"
    type: SIGMOID
    bottom: "fc1"
    top: "fc1"
  }
  layers {
    name: "fc2"
    type: INNER_PRODUCT
    bottom: "fc1"
    top: "fc2"
    blobs_lr: 1
    blobs_lr: 2
    inner_product_param {
      num_output: 100
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
  }
  layers {
    name: "fc2_sigmoid"
    type: SIGMOID
    bottom: "fc2"
    top: "fc2"
  }
  layers {
    name: "fc3"
    type: INNER_PRODUCT
    bottom: "fc2"
    top: "fc3"
    blobs_lr: 1
    blobs_lr: 2
    inner_product_param {
      num_output: 50
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
  }
  layers {
    name: "fc3_sigmoid"
    type: SIGMOID
    bottom: "fc3"
    top: "fc3"
  }
  layers {
    name: "fc_final"
    type: INNER_PRODUCT
    bottom: "fc3"
    top: "fc_final"
    blobs_lr: 1
    blobs_lr: 2
    inner_product_param {
      num_output: 3
      weight_filler {
        type: "xavier"
      }
      bias_filler {
        type: "constant"
      }
    }
  }
  layers {
    name: "accuracy"
    type: ACCURACY
    bottom: "fc_final"
    bottom: "label"
    top: "accuracy"
  }
  layers {
    name: "loss"
    type: SOFTMAX_LOSS
    bottom: "fc_final"
    bottom: "label"
    top: "loss"
  }